
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Окна = ПолучитьОкна();
	
	Для каждого ТекущееОкно Из Окна Цикл
	
		Если ТекущееОкно<>Неопределено и Не ТекущееОкно.Основное и Не ТекущееОкно.НачальнаяСтраница Тогда
			
			СписокОкон.Добавить(ТекущееОкно, ТекущееОкно.Заголовок, Ложь, БиблиотекаКартинок.Форма);			
		
		КонецЕсли;
	
	КонецЦикла;
	
	СписокОкон.СортироватьПоПредставлению();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьВыбранные(Команда)
	
	Для каждого ОкноСписка Из СписокОкон Цикл
	
		Если ОкноСписка.Пометка Тогда
		
			ОкноСписка.Значение.Содержимое[0].Закрыть();			
		
		КонецЕсли;
	
	КонецЦикла;	
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьВсеКромеТекущего(Команда)
	
	ТекущееОкно =  Элементы.СписокОкон.ТекущиеДанные.Значение;
	Для каждого ОкноСписка Из СписокОкон Цикл
	
		Если ОкноСписка.Значение <> ТекущееОкно Тогда
			
			ОкноСписка.Значение.Содержимое[0].Закрыть();			
		
		КонецЕсли;
	
	КонецЦикла;
	
	ТекущееОкно.Активизировать();
	Закрыть();
	
КонецПроцедуры











