
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ОбработатьНаСервере(ПараметрКоманды);
	ПоказатьОповещениеПользователя("Корректировка наименования", ,"Корректировка выполнена!", БиблиотекаКартинок.ВыполнитьЗадачу);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьНаСервере(ПараметрКоманды)

	Для каждого Элемент Из ПараметрКоманды Цикл
	
		СправочникОбъект = Элемент.ПолучитьОбъект();
		СправочникОбъект.Наименование = СокрЛП(СправочникОбъект.Наименование);
		СправочникОбъект.Записать();
	
	КонецЦикла;	

КонецПроцедуры // ОбработатьНаСервере()
