
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	
	НастройкаНачальнойСтраницы();
	УстановитьКомпактноеОтображение();
	//УстановитьИнтерфейс();
	
	ПараметрыСеанса.ТекущийПользователь = ОбщегоНазначенияСервер.ПолучитьТекущегоПользователя();
	
КонецПроцедуры

Процедура НастройкаНачальнойСтраницы()

	ВерсияИБ  = Константы.ВерсияИБ.Получить();
	Если ВерсияИБ = "" Тогда
		
		НастройкиНачальнойСтраницы = Новый НастройкиНачальнойСтраницы;
		СоставФорм = Новый СоставФормНачальнойСтраницы;
		СоставФорм.ЛеваяКолонка.Добавить("Обработка.ОбновлениеИнформационнойБазы.Форма.ПервыйЗапуск");
		НастройкиНачальнойСтраницы.УстановитьСоставФорм(СоставФорм);
		
		ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиНачальнойСтраницы", , НастройкиНачальнойСтраницы);
		
	ИначеЕсли ВерсияИБ <> Метаданные.Версия Тогда
		
		НастройкиНачальнойСтраницы = ХранилищеСистемныхНастроек.Загрузить("Общее/НастройкиНачальнойСтраницы");
		ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиНачальнойСтраницыПользователя", , НастройкиНачальнойСтраницы);
		
		НастройкиНачальнойСтраницы = Новый НастройкиНачальнойСтраницы;
		СоставФорм = Новый СоставФормНачальнойСтраницы;
		СоставФорм.ЛеваяКолонка.Добавить("Обработка.ОбновлениеИнформационнойБазы.Форма.Обновление");		
		НастройкиНачальнойСтраницы.УстановитьСоставФорм(СоставФорм);
		
		ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиНачальнойСтраницы", , НастройкиНачальнойСтраницы);
	
	КонецЕсли;

КонецПроцедуры

Процедура УстановитьКомпактноеОтображение()

	//Настройки = ХранилищеСистемныхНастроек.Загрузить("Общее/НастройкиКлиентскогоПриложения");
	//Настройки.ВариантМасштабаФормКлиентскогоПриложения =  ВариантМасштабаФормКлиентскогоПриложения.Обычный;
	//ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиКлиентскогоПриложения", , Настройки);

КонецПроцедуры

Процедура УстановитьИнтерфейс()

	Настройки = ХранилищеСистемныхНастроек.Загрузить("Общее/НастройкиКлиентскогоПриложения"); 
	
	Если Настройки = Неопределено Тогда
		
		Настройки = Новый НастройкиКлиентскогоПриложения;
		Настройки.ВариантИнтерфейсаКлиентскогоПриложения = ВариантИнтерфейсаКлиентскогоПриложения.Такси;
		ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиКлиентскогоПриложения", , Настройки);
	
	КонецЕсли;

	Если Настройки.ВариантИнтерфейсаКлиентскогоПриложения = ВариантИнтерфейсаКлиентскогоПриложения.Такси
		и Не ПолучитьФункциональнуюОпцию("ИнтерфейсТакси") Тогда
		
		Константы.ИнтерфейсВерсия82.Установить(Ложь);
		Константы.ИнтерфейсТакси.Установить(Истина);		
	
	КонецЕсли;
	
	Если Настройки.ВариантИнтерфейсаКлиентскогоПриложения = ВариантИнтерфейсаКлиентскогоПриложения.Версия8_2
		и Не ПолучитьФункциональнуюОпцию("ИнтерфейсВерсия82") Тогда
		
		Константы.ИнтерфейсВерсия82.Установить(Истина);
		Константы.ИнтерфейсТакси.Установить(Ложь);
	
	КонецЕсли;
	
КонецПроцедуры





