
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("КлючНазначенияИспользования", "ОтгрузкиСОсновногоСклада2");
	ПараметрыФормы.Вставить("ОтборПоОсновномуСкладу");
	ПараметрыФормы.Вставить("КлючПользовательскихНастроек", Новый УникальныйИдентификатор);
	
	ОткрытьФорму("Документ.РеализацияТоваровУслуг.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры
