
&НаКлиенте
Процедура СоздатьРеализацию(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Или Модифицированность Тогда
		//Для записи используем метод формы Записать() который возвращает Истину либо Ложь
		Если Не Записать() Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Основание",Объект.Ссылка);
	//"Основание" в данном случае параметр-расширение формы у которой основной реквизит - Объект
	//Если он заполнен, то перед созданием формы создается Объект после его создания 
	//автоматически запускается механизм ввода на основании (вызывается ОбработкаЗаполнения)
	
	//ОткрытьФорму("Документ.РеализацияТоваровУслуг.ФормаОбъекта",ПараметрыФормы,ЭтаФорма);
	
	//В предыдущем примере при повторном выполнении команды активировалась ранее открытая форма. 
	//Однако если необходимо каждый раз создавать новую форму (и новый объект) необходимо указать 4-й параметр КлючУникальности
	ОткрытьФорму("Документ.РеализацияТоваровУслуг.ФормаОбъекта",ПараметрыФормы,ЭтаФорма,Новый УникальныйИдентификатор);
	
КонецПроцедуры
