
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для каждого Элемент Из Элементы.Интерфейс.СписокВыбора Цикл
	
		Если Объект[Элемент.Значение] Тогда
			
			Интерфейс = Элемент.Значение;
			Прервать;
		
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнтерфейсПриИзменении(Элемент)
	
	Для каждого Элемент Из Элементы.Интерфейс.СписокВыбора Цикл
	
		Если Интерфейс = Элемент.Значение Тогда
			
			Объект[Элемент.Значение] = Истина;
			
		Иначе
			
			Объект[Элемент.Значение] = Ложь;
		
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбновитьИнтерфейс();
	
КонецПроцедуры
